11/data/attachments/bdf9b98e52a2da44.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_f3fefd47-8fea-4f37-9bc9-2056486b827a</nif:username>
            <nif:friendToBeAdded>Michael_hand_Friend_76895_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>